---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.ElementsBelongToOtherSystem
source: html/fb984692-75d6-cbc8-713f-045ea659e6cf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.ElementsBelongToOtherSystem Property

You have selected elements that are already part of other Systems that have assigned Equipment. The elements you selected cannot be added to this System.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementsBelongToOtherSystem { get; }
```